# GridChainSketchFailures Properties

---
The BuiltInFailuresGridChainSketchFailures type exposes the following members.
| Name| Description
---|---|---
| ClosedLoop|  GridChain sketch contains a closed loop.
| InvalidSketch|  Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines.
| MoreThanOneLoop|  GridChain sketch contains more than one loop.
| OverlappingLines|  GridChain sketch contains lines which overlap.
Top
#### Reference
BuiltInFailuresGridChainSketchFailures Class
Autodesk.Revit.DB Namespace